[
  {
    "id": "6d558351-c077-416a-90ec-b303aea58173",
    "title": "Chief Financial Officer",
    "department": "Finance",
    "location": "New Delhi, India",
    "type": "Full-time",
    "experience": "5+ years",
    "description": "The ideal candidate will possess a strong background in finance, accounting, and business processes, coupled with exceptional leadership and communication skills.\r\nWe are seeking an experienced and driven Finance Controller to join our dynamic team.\r\nThe Finance Controller will play a pivotal role in overseeing and optimizing financial operations, ensuring accurate financial reporting, analyzing performance metrics, and providing strategic insights to facilitate informed decision-making.\r\nThe candidate having experience of Fund raising via VC or listing would be preferred.",
    "responsibilities": "Prepare accurate and timely financial statements, including income statements, balance sheets, and cash flow statements.\r\nConduct variance analysis to highlight key performance drivers and discrepancies against budget and forecasts.\r\nInterpret financial data to provide actionable insights for improving financial performance.\r\nCollaborate with cross-functional teams to develop annual budgets and long-term financial forecasts.\r\nMonitor budget performance, identifying areas for improvement and cost-saving opportunities. Adjust forecasts based on changing market conditions, operational developments, and external\r\nEstablish and maintain robust internal controls to ensure financial accuracy and mitigate risks. Ensure compliance with relevant accounting standards, tax regulations, and industry-specific",
    "requirements": "Coordinate with internal and external auditors to facilitate smooth audit processes.\r\nAnalyse costs, including direct and indirect costs, overheads, and cost of goods sold.\r\nProvide insights into cost-effective strategies, process improvements, and resource allocation. Collaborate with production teams to optimize cost structures while maintaining quality\r\nOversee inventory tracking, valuation, and reconciliations to maintain accurate inventory records.\r\nImplement inventory control procedures to minimize waste, obsolescence, and stockouts. Monitor inventory turnover ratios and recommend adjustments as necessary.\r\nProvide strategic financial guidance to senior management for informed decision-making and growth initiatives.\r\nAssess investment opportunities, capital allocation, and potential acquisitions from a financial perspective.\r\nAssist in evaluating the financial impact of strategic decisions and business expansion.\r\nLead, mentor, and develop a team of finance professionals, fostering a collaborative and high-performance culture.\r\nSet performance goals, conduct regular performance reviews, and provide coaching and feedback.",
    "qualifications": "Bachelor’s degree in finance, Accounting, Business Administration, or a related field; CA preferred.\r\nProven experience (5+ years) in finance roles . In-depth understanding of business processes, cost accounting, and inventory\r\nProficiency in financial software, ERP systems, and advanced MS Excel skills.\r\nStrong analytical and problem-solving abilities, with a keen attention to detail. Excellent communication and interpersonal skills to liaise effectively with cross-functional team\r\nAbility to thrive in a fast-paced, dynamic environment and manage multiple priorities. Demonstrated track record of driving process improvements and operational efficiencies.",
    "benefits": "",
    "createdAt": "2025-07-05T10:48:31.959Z",
    "status": "active"
  },
  {
    "id": "a4f2d959-ffbe-408c-b105-62b6ce907a85",
    "title": "Assistant Manager ",
    "department": "Sales",
    "location": "Mumbai & Chennai, India",
    "type": "Full-time",
    "experience": "2-6 years",
    "description": "Assistant Sales Manager shall be reporting to Sales Manager of Vardhman and he shall be responsible for all Government , Private market in India which includes , Green/Brown field Airports/airbases/airstrips/ helipads and all landside business , he shall be working with Sr. Sales Manager and sales support team for sharing the responsibilities. He shall be focusing on , develop and drive Airfield Ground Lighting (AGL) , Control Monitoring System, Advance Visual Docking Guidance Systems (AVDGS) , GOS ( Gate Operating system, Photometric testing systems for AGL, Electrical low voltage Systems (HVAC IBMS, Alarm, CCTV, Access Control) business in India. He shall be point of contact for all Private and Government customers for all related technical and commercial queries.",
    "responsibilities": "Supervision of the entire techno-commercial value chain i.e. meeting customers, understanding their requirements, working on tenders, specking the tenders, working with airport consultants, end customers and contractors, giving inputs to sales support team in preparing technical and price bids, attending bid meetings, finalizing technical and commercial terms and negotiating with vendors and customers to become L1.\r\nCementing healthy customer relations with all departments at various levels for resolving problems or responding to enquiries with focus on the importance of exceeding customer requirements and maintained a satisfied customer base in India for continued business.\r\nDevelop a pipeline by involving at pre-bid stage before the release of tenders\r\nRegular visits to all stakeholders of customers, arrange presentations in Airport and Defense customers\r\nInfluence on specifications of tenders\r\nExperience in Handling Govt departments, Green/Brown field airports, LSTK, Consultants, Electrical Contractors and Projects in Airports and Defense\r\nFrequent travelling within India\r\nWeekly / monthly /Quarterly reporting on Targets to Sales director",
    "requirements": "B.E/Diploma in Electrical/Electronics / Computer Science Engineering\r\nAn ideal candidate should have 2 to 6 years of work experience on Sales of airfield lighting system, Control Monitoring Systems, Visual Docking Guidance System, ELV and security systems.",
    "qualifications": "Hands on experience of working on Airports and should be aware of basic principles & components of Airfield lighting Systems, VDGS, ELV and security systems.\r\nExposed to the criteria’s for design of the visual aids including the airfield ground lighting (AGL) systems, in accordance with Standards and Recommendations in ICAO, Annex 14, Aerodrome Design and Operations, and with ICAO´s Aerodrome Design Manual, Part 4: Visual Aids, and Part 5: Electrical installations and Civil Aviation Requirement ( CAR ) of DGCA/India.\r\nSkills to handle customers alone and final negotiations.\r\nExcellent Communication\r\nTarget oriented with a strong improvement reflex.\r\nCustomer satisfaction oriented Committed on results.\r\nGood Working Knowledge on Windows, Microsoft Office (Specially in Excel), Microsoft teams",
    "benefits": "",
    "createdAt": "2025-07-05T10:53:51.568Z",
    "status": "active"
  },
  {
    "id": "9e14f9b2-21a5-4418-9643-b3928cb83bcc",
    "title": "Electronic Engineer",
    "department": "Electronics",
    "location": "Delhi, India",
    "type": "Full-time",
    "experience": "2-5 years",
    "description": "Coordinate with vendors for component /PCB/microcontroller for technical specifications.\r\nShould be able to do testing and validation of product. Should be aware of general electronics concepts.\r\nHaving sound understanding of Integrated Circuits, Passive and Active Components.\r\nShould be having past experience from electronics manufacturing or Lighting Industries.\r\nShould be able to define/perform/verify quality check on electronics component.\r\nTroubleshooting\r\nCandidate should have Knowledge about PCB Designing tools & able to simulate the circuit.",
    "responsibilities": "Our company is currently looking for a dynamic, self-motivated Electronic Engineer to maintain and support our Airports solutions products, systems and engineering function. \r\nThe Electronic Engineer will work across a variety of functional groups that are directly involved in engineering, product development, Testing, Project implementation, and international contract manufacturing partners. The ideal candidate is an inventive problem solver that is capable of working through technical challenges and employing pragmatic solutions. This is a fantastic opportunity to join a team that provides integrated services to meet our clients’ needs.\r\nThe company is promoted by industry veterans and is growing rapidly and offer ample growth opportunity. Salary & remuneration will not be a constraint for right candidate.",
    "requirements": "Well versed in handling computers and MS office, MS projects\r\nPossess excellent analytical, Communication (Written & Verbal) & problem-solving abilities.\r\nDetail oriented and organized in work.\r\nAbility to work cooperatively and collaboratively with all levels of employees, management, and external customers.\r\nAbility to effectively organize and structure activities on daily basis, prioritize and manage multiple tasks simultaneously and work to a deadline.\r\nSelf-motivated, proactive, with a desire to learn/grow.",
    "qualifications": "Engineer have knowledge about - draft schematics, design analysis & calculations, BOM creation, component qualification and costing, de-rating analysis and documentation, design capabilities on analog, digital including microcontroller and power section, inventory management, Test Jig and development setup support, creating verification and validation documents, board level testing and troubleshooting, board/system bring up and testing board validation and verification.\r\nShould have Knowledge about PCB design (schematic to Gerber) and simulation tools.\r\nHaving sound understanding of Integrated Circuits, Passive and Active Components.\r\nShould be able to understand THD, PF, Efficiency, IR, Dielectric breakdown, ESD protection, EMI and EMC.\r\nKnowledge of steps involved in PCB manufacturing\r\nCircuit troubleshooting and finding fault using multimeter.\r\nShould be able to solder and desolder components from PCB",
    "benefits": "",
    "createdAt": "2025-07-05T10:56:55.648Z",
    "status": "active",
    "updatedAt": "2025-07-05T10:59:07.616Z"
  }
]