{
  "categories": {
    "air_traffic_management": {
      "title": "Air Traffic Management",
      "description": "Comprehensive systems for managing air traffic with advanced surveillance, communication, and control capabilities.",
      "image": "/images/categories/atm-category.jpg",
      "hasClassifications": false,
      "products": [
        "air_traffic_management_system",
        "trailer_mounted_mobile_atc",
        "digital_voice_recorder_system"
      ]
    },
    "airfield_equipment": {
      "title": "Airfield Equipment",
      "description": "Essential equipment for airfield operations including lighting, alarms, and traffic management systems.",
      "image": "/images/categories/airfield-category.jpg",
      "hasClassifications": false,
      "products": [
        "airfield_lighting_system",
        "airfield_alarm_system",
        "airfield_road_traffic_management",
        "external_pilot_cage_protection"
      ]
    },
    "navigation_tracking": {
      "title": "Navigation & Tracking",
      "description": "Advanced navigation aids and tracking systems for enhanced situational awareness and flight safety.",
      "image": "/images/categories/navigation-category.jpg",
      "hasClassifications": false,
      "products": [
        "portable_tracking_system",
        "ndb_beacon",
        "cadf_system",
        "aircraft_monitoring_system"
      ]
    },
    "weather_communication": {
      "title": "Weather & Communication",
      "description": "Meteorological and communication systems for comprehensive weather monitoring and tactical communications.",
      "image": "/images/categories/weather-category.jpg",
      "hasClassifications": false,
      "products": [
        "automatic_weather_observation_system",
        "weather_radar",
        "tactical_communication_system"
      ]
    },
    "support_equipment": {
      "title": "Support Equipment",
      "description": "Critical support systems including power generation, equipment shelters, and runway accessories.",
      "image": "/images/categories/support-category.jpg",
      "hasClassifications": false,
      "products": [
        "power_generation_system",
        "equipment_shelter",
        "runway_miscellaneous_equipment"
      ]
    },
    "airfield_lighting": {
      "title": "Airfield Lighting",
      "description": "Comprehensive lighting solutions for airfields including approach, runway, and guidance systems.",
      "image": "/images/categories/lighting-category.jpg",
      "hasClassifications": true,
      "classifications": {
        "airfield_ground_lights": {
          "title": "Airfield Ground Lights",
          "description": "Ground-based lighting systems for aircraft navigation and safety.",
          "products": [
            "photometric_system",
            "advanced_visual_docking_guidance_system",
            "ilcms"
          ]
        },
        "approach_lighting": {
          "title": "Approach Lighting",
          "description": "Lighting systems to guide aircraft during approach and landing phases.",
          "products": [
            "papi_lighting",
            "runway_lighting",
            "taxiway_lighting",
            "airfield_guidance_signs",
            "transformers_connector_kits",
            "ccrs_accessories",
            "heliport_lighting",
            "packaged_elevated_airfield_runway_lighting_system",
            "portable_lighting",
            "other_agl_products"
          ]
        },
        "led_technology": {
          "title": "LED Technology",
          "description": "Advanced LED-based lighting solutions for modern airfield operations.",
          "products": [
            "led_approach_light",
            "led_threshold_light",
            "led_runway_end_light",
            "elevated_approach_side_row",
            "elevated_threshold_threshold_wingbar",
            "elevated_runway_end_light",
            "inset_approach_siderow_barrette",
            "inset_threshold_light",
            "inset_runway_end_light",
            "inset_threshold_wingbar",
            "inset_threshold_runway_end_lights"
          ]
        }
      }
    },
    "smart_solutions": {
      "title": "Smart Solutions",
      "description": "Innovative smart technology solutions for modern infrastructure management.",
      "image": "/images/categories/smart-category.jpg",
      "hasClassifications": false,
      "products": [
        "smart_energy_meter",
        "emergency_alert_system"
      ]
    }
  }, 
  "products": {
    "air_traffic_management_system": {
      "title": "AIR TRAFFIC MANAGEMENT SYSTEM",
      "description": "The ATM (Air Traffic Management) system is a modern, integrated framework designed to ensure the safe, efficient, and coordinated movement of aircraft both in controlled airspace and at airports. Built to function in real-time, it enhances situational awareness and supports air traffic controllers with intelligent tools and automation. Key features include:",
      "image": "/images/atm1.jpg",
      "portfolioImage": "/images/atm2.jpg",
      "portfolioLines": [
        "Real-time aircraft tracking for enhanced flight safety and coordination.",
        "Integrated voice and data communication systems with advanced redundancy.",
        "Predictive conflict detection and resolution tools for air traffic controllers.",
        "Dynamic airspace management adaptable to both civil and military needs.",
        "Advanced weather data integration to ensure operational readiness in all conditions."
      ],
      "features": [
        "Ensures safe, orderly, and efficient movement of aircraft within controlled airspace and at airports",
        "Integrates surveillance, communication, navigation, and decision-support tools",
        "Assists air traffic controllers in: Monitoring aircraft positions, Predicting flight paths, Managing airspace conflicts",
        "Coordinates air and ground operations",
        "Designed to operate in real-time environments",
        "Incorporates automation and redundancy for improved reliability",
        "Features safety nets, weather data integration, and advanced situational awareness tools",
        "Enhances operational efficiency to meet growing air traffic demands"
      ]
    },
    "airfield_lighting_system": {
      "title": "RUNWAY / HELIPAD LIGHTING SYSTEM",
      "description": "Runway / Helipad Lighting Systems are critical for supporting enhanced night-time operations of helicopters under Visual Flight Rules (VFR) and with Night Vision Goggles (NVG). These systems ensure safe, reliable, and compliant visual guidance, particularly in low-visibility and night conditions.",
      "image": "/images/heli1.jpg",
      "portfolioImage": "/images/heli2.jpg",
      "portfolioLines": [
        "NVG-compatible lighting for safe night helicopter operations.",
        "ICAO-compliant helipad and runway lighting for global interoperability.",
        "HAPI systems ensure accurate approach guidance under low visibility.",
        "Modular lighting design supports tactical deployments and remote sites.",
        "Durable, weather-resistant systems for all-weather mission readiness."
      ],
      "features": [
        "Supports enhanced night flying for helicopters under VFR and with NVG",
        "Includes installation of: Dispersal area lights, Taxiway and helipad lighting, Approach path lights, Runway edge lights",
        "Fully compliant with ICAO Annex 14 and related international standards",
        "Features Helicopter Approach Path Indicator (HAPI) for: Accurate glide path guidance, Safe landings in night and low-visibility conditions",
        "Provides reliable visual cues for pilots during approach and landing",
        "Enhances operational safety, situational awareness, and mission readiness in all weather conditions"
      ],
      "main_equipment": [
        "Constant Current Regulators (CCRs)",
        "Elevated dispersal and Taxiway Edge Light Fittings",
        "Elevated / Inset Approach and Helipad Lights",
        "Isolation Transformers",
        "Connector Kits (Primary & Secondary)",
        "Adequately graded Lighting Cable",
        "Movement Area Guidance Signs",
        "Heliport Beacon (LED)",
        "HAPI"
      ]
    },
    "automatic_weather_observation_system": {
      "title": "AUTOMATIC WEATHER OBSERVATION SYSTEM (AWOS)",
      "description": "Automated Weather Observing System (AWOS) enhances airfield and operational safety by delivering continuous, real-time meteorological data. It plays a vital role in flight planning, runway management, and decision-making, ensuring accuracy and reliability under all weather conditions.",
      "image": "/images/awos1.jpg",
      "portfolioImage": "/images/awos2.jpg",
      "portfolioLines": [
        "Real-time meteorological updates for safe runway and airspace operations.",
        "Automated METAR/SPECI reporting streamlines pilot briefings and ATC response.",
        "Integrated wind, visibility, and cloud sensors for precise forecasting.",
        "Remote access ensures continuous monitoring from control towers or command centers.",
        "Designed for 24/7 reliability in extreme weather and tactical environments."
      ],
      "features": [
        "Ensures airfield safety with real-time weather data",
        "Monitors wind, temperature, humidity, visibility, and pressure",
        "Supports automated METAR/SPECI reporting",
        "Allows remote access from the ATC tower",
        "Includes lightning detection and cloud height sensors",
        "Reliable in all weather conditions for accurate forecasting"
      ]
    },
    "portable_tracking_system": {
      "title": "PORTABLE TRACKING SYSTEM",
      "description": "Portable Tracking System provides real-time aircraft tracking and enhanced situational awareness, ensuring efficient surveillance and coordination in dynamic airspace environments. Leveraging ADS-B technology, it offers precise flight monitoring and supports safer operations.",
      "image": "/images/track.jpg",
      "portfolioImage": "/images/ads-b.png",
      "portfolioLines": [
        "Real-time aircraft tracking with portable deployment capability.",
        "Utilizes ADS-B for precise flight position, speed, and altitude reporting.",
        "Integrated safety nets help prevent mid-air collisions and airspace conflicts.",
        "Rapid setup enables deployment in remote or tactical operations zones.",
        "Enhances situational awareness for both civilian and military coordination."
      ],
      "features": [
        "Enhances situational awareness and real-time aircraft monitoring",
        "Utilizes Automatic Dependent Surveillance–Broadcast (ADS-B) technology",
        "Enables accurate position tracking using satellite navigation and periodic data transmission",
        "Broadcasts key flight parameters: aircraft identification, location, altitude, and speed",
        "Provides timely surveillance data to ground-based controllers and nearby aircraft",
        "Improves safety, coordination, and airspace efficiency"
      ]
    },
    "aircraft_monitoring_system": {
      "title": "AIRCRAFT MONITORING SYSTEM FOR AIR TRAFFIC CONTROL RECORDING",
      "description": "Aircraft Monitoring System delivers continuous, intelligent monitoring for secure and efficient airbase/heliport operations. With advanced imaging and tracking technologies, it ensures comprehensive situational awareness in all conditions.",
      "image": "/images/moni1.jpg",
      "portfolioImage": "/images/moni2.jpg",
      "portfolioLines": [
        "360° surveillance with intelligent tracking for real-time aircraft monitoring.",
        "HD and starlight imaging ensures visibility during night and low-light operations.",
        "Integrated safety nets for movement prediction and collision risk mitigation.",
        "Supports coordinated take-off and landing oversight in dynamic environments.",
        "Seamless integration with ATC systems enhances overall airbase situational awareness."
      ],
      "features": [
        "Ideal for surveillance of aircraft and airbase operations",
        "Equipped with optical zoom, HD imaging, and starlight technology for low-light clarity",
        "Features intelligent tracking for dynamic object monitoring",
        "Ensures 24/7 coverage of aircraft movements, take-offs, and landings",
        "Rugged, weather-resistant design for dependable outdoor use",
        "Offers 360° pan and tilt for complete area surveillance",
        "Enhances security via real-time video streaming, video analytics, and integration with broader systems"
      ]
    },
    "airfield_alarm_system": {
      "title": "AIRFIELD/ HELIPORT ALARM SYSTEM",
      "description": "The Airfield alarm system swiftly alerts emergency services, including ambulances, fire departments, and other agencies, in the event of a crash. It is designed for scalability, allowing integration with multiple control panels. As a airfield alarm system, it supports various radio and wired communication methods at airports, such as HF/VHF/UHF, intercoms, analog phones, and IP phones. Operators using airfield alarm system can select between intercom and external communication via HF, VHF, UHF, or phone lines. Additionally, the system enables broadcasting audio messages and alarm notifications across all locations.",
      "image": "/images/alarm1.jpg",
      "portfolioImage": "/images/alarm.jpg",
      "portfolioLines": [
        "Instant emergency alerts trigger coordinated response from fire, ambulance, and security teams.",
        "Supports multi-channel communication: HF/VHF/UHF radios, intercoms, analog & IP phones.",
        "Broadcasts alarms and voice messages simultaneously across all airport zones.",
        "Redundant network architecture ensures uninterrupted operation during crises.",
        "Integrated safety logic and alert routing act as operational safety nets during emergencies."
      ],
      "features": [
        "Complies with ICAO standards, making it well-suited for airport operations and fire alarm centers",
        "Equipped with dual power supplies and two Ethernet networks (Primary and Backup) for reliability",
        "Utilizes a VoIP-based platform and conforms to the ED137 B/C standard",
        "Developed with structured software management in line with ED153 compliance",
        "Seamlessly connects to digital radios following the ED-137B/C standard",
        "Supports direct IP phone connectivity in accordance with RFC3261 guidelines",
        "Enables integration with analog radios and telephone networks via a media gateway",
        "Offers an interface for connecting to analog recording systems",
        "Features an integrated control panel capable of short-term automatic conversation recording",
        "Synchronizes with a GPS clock using NTP standards for precise timekeeping"
      ],
      "key_functionalities": [
        "Airfield alarm system for immediate emergency response",
        "Public address system for announcements and alerts",
        "Input/output relays to control external devices like lights, sirens, and alarms",
        "Intercom communication for efficient coordination",
        "Connectivity between control panels and various airport systems",
        "Direct communication between the control panel and radios",
        "Seamless cross-connection between different communication methods",
        "Ability to broadcast messages and alarms across all airport locations",
        "Operates in English with customizable language and GUI settings",
        "Designed for easy installation, deployment, and operation"
      ]
    },
    "airfield_road_traffic_management": {
      "title": "AIRFIELD ROAD TRAFFIC MANAGEMENT SYSTEM",
      "description": "Airfield Road Traffic Management System provides secure and efficient access control across critical runway areas, supporting operational safety through automation and visibility.",
      "image": "/images/boom2.jpg",
      "portfolioImage": "/images/boom1.jpg",
      "portfolioLines": [
        "Automated boom barriers ensure restricted vehicle access to critical airside zones.",
        "Integrated traffic signals enhance movement coordination and safety across runways.",
        "Wireless control from ATC and Crash Bay enables rapid override and emergency response.",
        "Redundant command pathways act as operational safety nets for fail-safe access control.",
        "Optimized for high-visibility and all-weather performance to maintain 24/7 reliability."
      ],
      "features": [
        "Ensures safe and controlled access across runway safety zones",
        "Fully automated boom barrier system with integrated traffic light signals",
        "Weatherproof design for consistent performance in all environmental conditions",
        "Visibility range effective up to 50 meters",
        "Wireless control from both ATC Tower and Crash Bay for centralized operation and system redundancy"
      ]
    },
    "tactical_communication_system": {
      "title": "TACTICAL COMMUNICATION SYSTEM",
      "description": "Tactical Communication Integrated System delivers reliable, secure, and multi-channel voice communication for coordinated command and control in dynamic environments.",
      "image": "/images/comm2.jpg",
      "portfolioImage": "/images/comm3.jpg",
      "portfolioLines": [
        "Multi-channel voice communication links fixed, mobile, and field command centers.",
        "VoIP-enabled Controller Terminals support mission-specific voice conferencing and PTT.",
        "Media Gateway integrates analog/digital radios and phones for seamless coordination.",
        "Ruggedized for rapid deployment in tactical vehicles, ships, or remote posts.",
        "Built-in safety nets with redundant power and network paths ensure uptime in critical ops."
      ],
      "features": [
        "Enables fast communication across mobile and fixed command centres",
        "Supports wired and wireless networks: fibre, copper, microwave, and satellite",
        "Built-in redundancy for power and transmission ensures uninterrupted operation",
        "Compact, rugged design allows rapid deployment on vehicles, ships, or fixed sites",
        "Resistant to vibration, extreme temperatures, and humidity for all-terrain durability"
      ],
      "components": [
        {
          "name": "Controller Terminal",
          "description": "The Controller Terminal is a VoIP device with a high-resolution touchscreen interface that allows users to operate the system efficiently. Its user interface layout can be customized based on individual configurations and requirements. Built to be compact, resistant to vibrations, and dustproof, the terminal includes a complete set of mounting accessories for vehicle installation or standalone use. Each unit comes fully equipped with headsets, handsets, and external speakers, enabling seamless connectivity with other system components. The Controller Terminal supports radio PTT, short-term recording, voice conferencing, internal voice communication, call queuing, and user-based configurations tailored to specific roles and tasks. Additionally, it provides log queries, records all user activity history, and displays functional areas on-screen for easy access."
        },
        {
          "name": "Media Gateway",
          "description": "The Media Gateway is a multimedia, multi-protocol interconnect device designed to convert various connection interfaces into an IP interface, ensuring seamless IP connectivity for other devices. It facilitates connections with Controller Terminals, analog radios, digital radios, RoIP, and PABX/PSTN systems. Users can configure this equipment for multiple purposes, such as an analog internal telephone system or an IP-based telephone exchange, depending on their communication needs. The Media Gateway supports a wide range of analog connectors (up to multiple interfaces) and IP phones (up to 150 terminals). Built on IP technology, it is designed for deployment in various command centers and can be easily expanded when necessary, making it a scalable and adaptable communication solution."
        }
      ]
    },
    "digital_voice_recorder_system": {
      "title": "Digital Voice Recorder System",
      "description": "The Digital Recorder System shall be a complete network-based solution to record, playback and analyze all data exchanged in an ATC/ATM. System architecture is based on hardware and software components connected through a redundant LAN and must be Compliance with ICAO recommendations with features of Video, Audio and Data Acquisition and Sampling, Storage, Playback, Post-Analysis, System Management and automatic registration and security.",
      "image": "/images/dvdr2.png",
      "portfolioImage": "/images/dvdr.png",
      "portfolioLines": [
        "Network-based recording and analysis of voice, video, and data across ATC/ATM systems.",
        "ICAO-compliant system supports VoIP, analog, and protocol-based data acquisition.",
        "Secure, encrypted storage with redundancy via SSD, dual LAN, and NAS extensions.",
        "Graphical timeline reconstruction enables precise playback for incident analysis.",
        "Built-in safety nets like watchdog monitoring and SNMP alerts ensure 24/7 operational integrity."
      ],
      "features": [
        "The Recorder system designed in accordance to the latest editions of ICAO standards",
        "Recorder system should be based on distributed architecture, flexible, scalable, and redundant",
        "Safe data acquisition, no streaming and multi-format data acquisition capability",
        "Capability for multi-protocol data acquisition processing data packets based on different formats and protocols",
        "VoIP / SIP streams with at least 24 VoIP Channels and 16 Analog channels",
        "Maximum reliability with dual LAN connection in bonding, dual hot swappable Power Supply units",
        "Local storage using Solid State Disk (SSD)- 1 TB or better and extended through NAS",
        "Time Synchronization based on NTP",
        "Watchdog feature to monitor system health with SNMP alarms & events",
        "Integrated dashboard to monitor system health status and provide usage reports",
        "Secure (https) remote archiving to centralized archive",
        "Encrypted recordings",
        "Secure (https) web-based user interface for search & replay, incident reconstruction, reporting, export and system management",
        "Reconstruction features with graphical overview of recordings in timeline and audio mixing for 4 channels concurrently",
        "Export recordings and metadata in MP4/AVI for video, WAV/MP3 for audio and TXT for Keyboard & Mouse data",
        "Impound Module to export recordings and metadata securely (encrypted) to third party for investigation purposes",
        "Full Audit Trail to log User & System Manager activity",
        "Real-time and post-acquisition advanced data analysis, decoding data packets by protocol decoders",
        "User Friendly Graphical User Interface"
      ]
    },
    "external_pilot_cage_protection": {
      "title": "EXTERNAL PILOT CAGE PROTECTION",
      "description": "External Pilot Cage Protection system with remote control and operation as per specification below:",
      "image": "/images/cage.jpg",
      "portfolioImage": "/images/cage2.jpg",
      "portfolioLines": [
        "Hydraulic telescopic bollards offer secure access control for high-risk airfield zones.",
        "Operable via dual-side control panels with key switch safety mechanisms.",
        "Manual override and genset support ensure uninterrupted operation during emergencies.",
        "IP67-rated construction and wide temperature tolerance for all-weather reliability.",
        "High-load galvanized steel bollards act as physical safety nets against unauthorized vehicle access."
      ],
      "features": [
        "Drive Mechanism: Hydraulic",
        "Type of Boom: Telescopic / Two-Fence",
        "Power Supply Type: 3-Phase 440V AC, 50 Hz",
        "Motor Power Rating: 3.8 KW",
        "Bollard Tube Diameter: 275 mm",
        "Bollard Tube Height: 1200 mm",
        "Bollard Tube Material: High Strength Galvanized Steel",
        "Rising Time: Up to 6 seconds",
        "Operating Temperature Range: -20°C to +60°C",
        "Lowering Time: Up to 5 seconds",
        "Manual Lowering Option: Required",
        "Control Panel: Operable from both sides of the bollard via push buttons with key switch control",
        "Ingress Protection Rating: IP 67",
        "Duty Cycle Rating: 1",
        "Illumination: Red LED / Reflective Tape",
        "Emergency / Power Failure Operation: Manual operation with hand-pump, Operation with Genset",
        "Total Weight: 400 - 600 kg",
        "Total Load Capacity: 60 kN",
        "Vertical Load Capacity: 100 kN",
        "Electrical Control Enclosure: Steel or Galvanized Powder-Coated Cabinet"
      ]
    },
    "power_generation_system": {
      "title": "POWER GENERATION SYSTEM",
      "description": "In an operational scenario, power failure can jeopardize the operation and in case of aviation, it could be even fatal. Therefore, an alternate power generating system is considered essential.",
      "image": "/images/power1.jpg",
      "portfolioImage": "/images/power3.jpg",
      "portfolioLines": [
        "Auto-start feature ensures uninterrupted power during mains failure, critical for ATC and airbase safety.",
        "Silent diesel operation minimizes noise pollution in sensitive airfield zones.",
        "Eco-compliant design meets CPCB-4 standards for sustainable aviation infrastructure.",
        "Integrated AMF panel and load management system enable intelligent energy distribution.",
        "Acts as a vital operational safety net, maintaining continuity of radar, lighting, and communication systems."
      ],
      "features": [
        "Type: Silent Diesel Generator",
        "Power Rating: 125 KVA",
        "Voltage: 415 V",
        "Compliance: CPCB-4 (Central Pollution Control Board – Stage 4)",
        "Eco-Friendly Design: Yes",
        "Automatic Start Feature: Auto start on mains power failure",
        "Mounting: Engine and alternator mounted on common base frame",
        "Included Components: Fuel tank, batteries with leads, AVM pads, residential silencer, exhaust pipes",
        "Lube Oil: First fill included",
        "Controller: Yes – with Auto Mains Failure (AMF) panel and load management",
        "Distribution Accessories: Distribution box, cables, switches, etc. as per load rating and ISI compliance",
        "Standards Compliance: ISI standards for all operational accessories"
      ]
    },
    "runway_miscellaneous_equipment": {
      "title": "RUNWAY/ TOWER MISCELLANEOUS EQUIPMENTS",
      "description": "",
      "image": "/images/run3.jpg",
      "portfolioImage": "/images/run4.jpg",
      "portfolioLines": [
        "Hydraulic-driven telescopic bollards provide high-impact resistance for critical airfield entry points.",
        "Designed for extreme conditions with IP67 ingress protection and wide operating temperature range.",
        "Manual override and hand-pump operation ensure functionality during emergencies or power failure.",
        "Key-switch control and dual-side access panels enhance secure, controlled access management.",
        "Acts as a robust safety net, protecting external pilot cages and preventing unauthorized intrusion."
      ],
      "features": [
        "Lightning Protection: Protection for all external structures, Over-voltage protection on all subsystem cabling, Protection at all antenna-transceiver interfaces",
        "Time Synchronization: All systems shall be synchronized centrally with a LAN-based Time Synchronization System to ensure uniform timekeeping across all units",
        "Fire Fighting Arrangements: Appropriate and sufficient fire extinguishing measures should be implemented to ensure the safety of all equipment and personnel"
      ],
      "equipment_list": [
        {
          "name": "Wind Direction Indicator",
          "spec": "Polyester PU fabric, ICAO Size 2 windsock, 4.5m frangible tower, 360° rotation, 4 LED lights, 1 obstruction light, stainless steel base, aviation red & white paint, foundation template"
        },
        {
          "name": "Landing T",
          "spec": "Illuminated to indicate wind/runway direction, clearly visible from airborne for distance & height"
        },
        {
          "name": "Ultrasonic Bird Scarer",
          "spec": "Coverage: up to 30 acres, Power: 12VDC/Solar, Weight: 7-10 kg, Sound Pressure: 125dB, Frequency: 2-10kHz, UL/CE compliant"
        },
        {
          "name": "Ground Comm. Handheld Sets",
          "spec": "Digital VHF/UHF, 446 MHz, 16 channels, ~10 km range, 8-72 hrs battery, easy to assemble, Motorola type"
        },
        {
          "name": "Base Station ICOM Set",
          "spec": "VHF 118-136.975 MHz, 25kHz/8.33kHz spacing, 6W output, 13.8/27.5V DC, -20°C to +60°C operation, compact/lightweight"
        }
      ]
    },
    "trailer_mounted_mobile_atc": {
      "title": "TRAILER MOUNTED MOBILE ATC",
      "description": "Provides flexible, reliable, and scalable air traffic control in various operational scenarios. Use Cases: Ideal for: Temporary airfields, Remote locations, Emergency air traffic management. Functionality: Enables seamless control and communication with aircraft. Tower Cabin: Elevatable design with adjustable height steps. Floor height over terrain options: 6.5 m, 8 m, or 12 m. Height depends on lifting system type requirements.",
      "image": "/images/mobile2.jpg",
      "portfolioImage": "/images/mobileatc.jpg",
      "portfolioLines": [
        "Rapid deployment capability for emergency, temporary, or remote ATC operations.",
        "Elevated cabin design ensures 360° situational visibility and glare-free control.",
        "Integrated communication suite and meteorological sensors for full ATC functionality.",
        "Hydraulic lift system with safety locking enables flexible elevation based on terrain.",
        "Acts as a mobile airspace safety net, supporting controlled aircraft movement in tactical zones."
      ],
      "features": [
        "Type: Container with 360 deg view with tilted and tinted bulletproof glass to avoid glare effect inside ATC",
        "Size of container: 6m*3m*3m (approx.)",
        "Sitting: Provision and supply of sitting arrangement and foldable bunker bed for 3 person. Modular & foldable interior furniture",
        "AC – 02 no's: Air Conditioned with external power option",
        "Power: Provision and supply of silent generator along with power change over switch and module to take on load of all Equipments and electronic items",
        "Lighting: Sufficient lighting to meet Day & Night operational requirement. Also, to fit Aerodrome beacon light",
        "Hydraulic Lift: Option to lift the cabin and locking option to raise and lock the lift at various heights levels upto 10 feet",
        "Staircase/ Ladder: Provision and supply of staircase/ladder compatible with the container at all heights",
        "Communication: 02 x A210 Ground to Air VHF Transceiver radio set Adequate power supply points and ports for fitments of requisite antennas",
        "Met eqpt: One compact AWOS with antenna and accessories",
        "Earthing Protection: ATC Cabin must have sufficient earthing points for safety",
        "Interior Safety: Interior must be fireproof. Entire cabin must be thermo-conditioned using correct insulation materials/ panels, suitable to the requirements as per environmental conditions",
        "Sound Proofing: Adequate sound proofing with correct and suitable materials",
        "Mount: Trailer based. 04 x all terrain tyres",
        "Fire Safety: Fire retardant interior material Provision of fitment for adequate and suitable firefighting equipment",
        "Camouflage: Exterior surface must be designed and painted to have camouflage, as per terrain suitability"
      ]
    },
    "weather_radar": {
      "title": "WEATHER RADAR",
      "description": "A Weather Radar is a specialized radar system designed to detect and track meteorological conditions such as rain, storms, wind patterns, and cloud formations. It plays a vital role in enhancing flight safety, providing early warnings, and assisting in air traffic management, especially during adverse weather. By continuously monitoring atmospheric conditions, it supports operational planning, real-time awareness, and informed decision-making by pilots, air traffic controllers, and meteorologists.",
      "image": "/images/radar2.jpg",
      "portfolioImage": "/images/radar3.png",
      "portfolioLines": [
        "Real-time detection of rainfall, thunderstorms, and turbulence enhances flight safety.",
        "Doppler capabilities allow early identification of wind shear and storm cell movement.",
        "Improves situational awareness for pilots and ATC during adverse weather conditions.",
        "Supports proactive planning and routing to minimize weather-related delays and risks.",
        "Acts as a safety net by issuing early warnings for hazardous weather in terminal and en-route zones."
      ],
      "features": [
        "Radio Wave Transmission: Sends radio waves into the atmosphere to detect weather disturbances",
        "Precipitation Detection: Identifies particles like raindrops or hail through signal reflection",
        "Return Signal Analysis: Detects rain intensity, Determines weather location and distance, Tracks storm movement and speed, Measures wind shear and turbulence using Doppler technology",
        "Severe Weather Monitoring: Enhances flight planning and safety during severe weather conditions",
        "Early Hazard Warnings: Provides alerts for hazardous weather, helping prevent in-flight and operational risks",
        "Operational Integration: Assists in decision-making for air traffic control and meteorological services"
      ]
    },
    "ndb_beacon": {
      "title": "NDB - NON-DIRECTIONAL BEACON",
      "description": "A Non-Directional Beacon (NDB) is a ground-based radio transmitter used in aviation for navigation. It emits signals in all directions to provide bearing information to aircraft, aiding pilots in determining their direction relative to the beacon. NDBs operate in the low to medium frequency (LF/MF) bands and function reliably under all weather conditions.",
      "image": "/images/ndb2.jpg",
      "portfolioImage": "/images/ndb1.jpg",
      "portfolioLines": [
        "Provides continuous 360° bearing signals for reliable aircraft navigation.",
        "Enables pilots to determine position relative to the beacon using onboard ADF systems.",
        "Functions as a dependable navigation aid in all weather and visibility conditions.",
        "Supports enroute tracking and non-precision approach procedures at remote or secondary airfields.",
        "Acts as a cost-effective safety net and backup to satellite-based navigation systems."
      ],
      "features": [
        "Operates in the low to medium frequency (LF/MF) bands",
        "Emits signals in all directions to provide 360° coverage",
        "Provides bearing information, not distance",
        "Functions reliably in all weather conditions",
        "Compatible with aircraft Automatic Direction Finder (ADF) systems",
        "Supports enroute navigation and non-precision approaches",
        "Serves as a backup navigation aid to GPS and other modern systems",
        "Simple and cost-effective ground-based navigation aid"
      ]
    },
    "cadf_system": {
      "title": "CADF - Commutated Aerial Direction Finding",
      "description": "CADF is a ground-based system that detects the direction from which a radio signal is transmitted by an aircraft. It helps air traffic controllers locate aircraft, especially when radar or ADS-B is unavailable. CADF improves navigation, search and rescue operations, and serves as a reliable backup tracking system.",
      "image": "/images/cad1.jpg",
      "portfolioImage": "/images/cad2.jpg",
      "portfolioLines": [
        "Real-time direction-finding of aircraft transmissions enhances situational awareness.",
        "Supports search and rescue operations by triangulating signal sources during emergencies.",
        "Functions as a resilient backup when radar or ADS-B coverage is lost or degraded.",
        "Integrated with ATC systems for seamless signal triangulation and coordination.",
        "Essential safety net for airbases, remote airfields, and high-risk operational zones."
      ],
      "features": [
        "Receives VHF/UHF radio transmissions from aircraft",
        "Calculates the direction or bearing of the received signal",
        "Sends real-time data to air traffic controllers for enhanced aircraft location awareness",
        "Often integrated with radar and communication systems for better coordination",
        "Supports operations in airport towers, area control centres, and military airbases",
        "Enhances navigation, search and rescue, and backup tracking capabilities",
        "Provides critical situational awareness during loss of primary surveillance systems"
      ]
    },
    "equipment_shelter": {
      "title": "Equipment Shelter",
      "description": "An equipment shelter is a secure, weather-resistant structure designed to house and protect sensitive electronic or mechanical equipment. These shelters are commonly used in defense for telecommunications utilities.",
      "image": "/images/runnn.jpg",
      "portfolioImage": "/images/equipment.png",
      "portfolioLines": [
        "Secure, climate-controlled enclosures protect mission-critical electronics from harsh environments.",
        "Customizable interiors support racks, power systems, fire suppression, and network gear.",
        "Designed for high-security zones with reinforced walls and intrusion-resistant features.",
        "Optional mobility allows rapid deployment for field operations and tactical scenarios.",
        "Integrated with backup power and connectivity to ensure uninterrupted functionality."
      ],
      "features": [
        "Environmental Protection: Shield equipment from rain, snow, wind, dust, and extreme temperatures. Often include insulation and Air conditioning systems to maintain controlled internal conditions",
        "Security: Lockable doors, reinforced structures, and sometimes surveillance systems to protect against theft and vandalism",
        "Power and Connectivity: Equipped with electrical power distribution, backup power systems (like batteries or generators), and network connections",
        "Customization: Can be tailored to specific needs: size, internal racks, cooling systems, lighting, fire suppression, etc.",
        "Mobility (Optional): Some shelters are portable or mounted on trailers for rapid deployment in remote or temporary locations"
      ]
    },
    "smart_energy_meter": {
      "title": "Smart Energy Meter",
      "description": "The Smart Energy Meter is a modern power monitoring device designed to bring visibility, efficiency, and control to energy usage. It helps users track how much electricity is being consumed in real time, manage consumption more responsibly, and make informed energy decisions. Whether in homes, offices, or large facilities, this meter empowers users to reduce wastage and promote a more sustainable lifestyle.",
      "image": "/images/smart2.jpg",
      "portfolioImage": "/images/smart-mtr.jpg",
      "portfolioLines": [
        "Reliable enclosures that keep vital equipment safe from extreme weather and tough conditions.",
        "Flexible interior setups that can be tailored to fit power systems, network devices, and other essential gear.",
        "Built for secure areas, with strong construction to prevent unauthorized access.",
        "Can be designed for mobility, making them easy to move and deploy wherever needed.",
        "Comes with built-in power backup and connectivity options to keep operations running without interruption."
      ],
      "features": [
        "Accurately measures electricity usage and displays consumption data clearly",
        "Enables users to monitor daily, weekly, and monthly power usage patterns",
        "Provides timely alerts and notifications to avoid excessive energy consumption",
        "Supports load management to prioritize critical devices during peak usage",
        "Displays total usage even during power outages using backup display mode",
        "Allows secure data access for billing and reporting purposes",
        "Designed to resist tampering and unauthorized access",
        "Includes built-in safety protections and works reliably in varied environmental conditions",
        "Ideal for use in homes, commercial buildings, and industrial setups",
        "Encourages smarter energy choices and contributes to lower electricity bills"
      ]
    },
    "emergency_alert_system": {
      "title": "Emergency Alert System",
      "description": "The Emergency Alert System is a dedicated device equipped with an integrated application designed to send instant emergency SMS alerts. Users can quickly select the type of emergency and their location details, which are included in the alert message. It ensures rapid notification to designated contacts during critical situations, supporting faster response and improved situational awareness.",
      "image": "/images/alert3.jpg",
      "portfolioImage": "/images/alert1.jpeg",
      "portfolioLines": [
        "Secure, climate-controlled enclosures protect mission-critical electronics from harsh environments.",
        "Customizable interiors support racks, power systems, fire suppression, and network gear.",
        "Designed for high-security zones with reinforced walls and intrusion-resistant features.",
        "Optional mobility allows rapid deployment for field operations and tactical scenarios.",
        "Integrated with backup power and connectivity to ensure uninterrupted functionality."
      ],
      "features": [
        "Sends emergency SMS alerts instantly via a dedicated hardware device",
        "User-friendly interface for selecting emergency type: medical, fire, intrusion, etc.",
        "Allows users to include location details with the alert message",
        "Pre-configured contact groups ensure alerts reach the right people every time",
        "Operates independently without requiring constant connectivity",
        "Stores alert history for post-incident review and analysis",
        "Compact, durable design suitable for critical environments"
      ]
    },
    "photometric_system": {
      "title": "Photometric System",
      "description": "A system designed to measure and analyze the intensity and distribution of light for airfield lighting compliance and maintenance.",
      "image": "/images/photometric.jpg",
      "features": [
        "Accurate measurement of light intensity",
        "Ensures compliance with ICAO standards",
        "Portable and easy to deploy on airfields"
      ]
    },
    "advanced_visual_docking_guidance_system": {
      "title": "Advanced Visual Docking Guidance System",
      "description": "Guides pilots for precise aircraft docking at gates, improving safety and turnaround efficiency.",
      "image": "/images/avdgs.jpg",
      "features": [
        "Real-time visual guidance for pilots",
        "Reduces risk of docking accidents",
        "Integrates with airport management systems"
      ]
    },
    "ilcms": {
      "title": "Integrated Lighting Control & Monitoring System (ILCMS)",
      "description": "Centralized system for controlling and monitoring all airfield lighting, ensuring operational efficiency and safety.",
      "image": "/images/ilcms.jpg",
      "features": [
        "Centralized control of airfield lights",
        "Real-time monitoring and diagnostics",
        "Supports remote operation"
      ]
    },
    "papi_lighting": {
      "title": "PAPI Lighting",
      "description": "Precision Approach Path Indicator (PAPI) lights provide visual glide slope guidance to pilots during approach.",
      "image": "/images/papi.jpg",
      "features": [
        "Highly visible approach guidance",
        "Compliant with international standards",
        "Low maintenance design"
      ]
    },
    "runway_lighting": {
      "title": "Runway Lighting",
      "description": "Comprehensive lighting solutions for runway edges, thresholds, and centerlines to ensure safe aircraft operations.",
      "image": "/images/runway-lighting.jpg",
      "features": [
        "High-intensity LED fixtures",
        "Weather-resistant and durable",
        "Easy installation and maintenance"
      ]
    },
    "taxiway_lighting": {
      "title": "Taxiway Lighting",
      "description": "Reliable lighting for taxiways, enhancing ground movement safety and efficiency.",
      "image": "/images/taxiway-lighting.jpg",
      "features": [
        "Energy-efficient LED technology",
        "Clear guidance for pilots",
        "Long operational life"
      ]
    },
    "airfield_guidance_signs": {
      "title": "Airfield Guidance Signs",
      "description": "Illuminated signs for clear taxiway and runway identification, improving airfield navigation.",
      "image": "/images/guidance-signs.jpg",
      "features": [
        "High-visibility signage",
        "Customizable for any airfield",
        "Weatherproof construction"
      ]
    },
    "transformers_connector_kits": {
      "title": "Transformers & Connector Kits",
      "description": "Essential components for reliable power distribution and connectivity in airfield lighting systems.",
      "image": "/images/transformers.jpg",
      "features": [
        "Robust and safe electrical connections",
        "Easy installation and replacement",
        "Supports all standard airfield lighting"
      ]
    },
    "ccrs_accessories": {
      "title": "CCRs & Accessories",
      "description": "Constant Current Regulators (CCRs) and accessories for stable power supply to airfield lighting circuits.",
      "image": "/images/ccrs.jpg",
      "features": [
        "Stable and adjustable current output",
        "Compatible with various lighting systems",
        "Built-in safety features"
      ]
    },
    "heliport_lighting": {
      "title": "Heliport Lighting",
      "description": "Specialized lighting systems for heliports, ensuring safe take-off and landing operations.",
      "image": "/images/heliport-lighting.jpg",
      "features": [
        "NVG-compatible options",
        "Weather-resistant fixtures",
        "Easy to install and maintain"
      ]
    },
    "packaged_elevated_airfield_runway_lighting_system": {
      "title": "Packaged Elevated Airfield Runway Lighting System",
      "description": "Complete, ready-to-install elevated lighting system for airfield runways.",
      "image": "/images/packaged-runway.jpg",
      "features": [
        "All-in-one solution",
        "Quick deployment",
        "Meets international standards"
      ]
    },
    "portable_lighting": {
      "title": "Portable Lighting",
      "description": "Mobile lighting units for temporary or emergency airfield operations.",
      "image": "/images/portable-lighting.jpg",
      "features": [
        "Battery or generator powered",
        "Easy to transport and deploy",
        "Bright, reliable illumination"
      ]
    },
    "other_agl_products": {
      "title": "Other AGL Products",
      "description": "A range of additional Airfield Ground Lighting products for specialized needs.",
      "image": "/images/agl-other.jpg",
      "features": [
        "Custom solutions available",
        "Meets all regulatory requirements",
        "Durable and efficient"
      ]
    },
    "led_approach_light": {
      "title": "LED Approach Light",
      "description": "Energy-efficient LED lights for approach paths, enhancing visibility and safety.",
      "image": "/images/led-approach.jpg",
      "features": [
        "Long lifespan LEDs",
        "Low power consumption",
        "High-intensity output"
      ]
    },
    "led_threshold_light": {
      "title": "LED Threshold Light",
      "description": "LED lights marking runway thresholds for clear pilot guidance.",
      "image": "/images/led-threshold.jpg",
      "features": [
        "Bright, uniform illumination",
        "Weatherproof design",
        "Easy maintenance"
      ]
    },
    "led_runway_end_light": {
      "title": "LED Runway End Light",
      "description": "LED fixtures for marking runway ends, ensuring safe aircraft operations.",
      "image": "/images/led-runway-end.jpg",
      "features": [
        "High-visibility output",
        "Low maintenance",
        "Energy efficient"
      ]
    },
    "elevated_approach_side_row": {
      "title": "Elevated Approach Side Row",
      "description": "Elevated side row lights for approach lighting systems.",
      "image": "/images/elevated-approach.jpg",
      "features": [
        "Robust construction",
        "Easy installation",
        "Consistent performance"
      ]
    },
    "elevated_threshold_threshold_wingbar": {
      "title": "Elevated Threshold/Threshold Wingbar",
      "description": "Elevated threshold and wingbar lights for enhanced runway edge visibility.",
      "image": "/images/elevated-threshold.jpg",
      "features": [
        "High-intensity LEDs",
        "Long operational life",
        "Weather-resistant"
      ]
    },
    "elevated_runway_end_light": {
      "title": "Elevated Runway End Light",
      "description": "Elevated lights marking the end of runways for improved safety.",
      "image": "/images/elevated-runway-end.jpg",
      "features": [
        "Bright, reliable illumination",
        "Easy to install",
        "Durable design"
      ]
    },
    "inset_approach_siderow_barrette": {
      "title": "Inset Approach Siderow Barrette",
      "description": "Inset lights for approach siderows, providing clear guidance in all conditions.",
      "image": "/images/inset-approach.jpg",
      "features": [
        "Flush-mounted for minimal obstruction",
        "High-visibility LEDs",
        "Long-lasting performance"
      ]
    },
    "inset_threshold_light": {
      "title": "Inset Threshold Light",
      "description": "Inset lights marking runway thresholds, flush with pavement for safety.",
      "image": "/images/inset-threshold.jpg",
      "features": [
        "Durable, load-bearing design",
        "Bright LED output",
        "Easy to maintain"
      ]
    },
    "inset_runway_end_light": {
      "title": "Inset Runway End Light",
      "description": "Inset lights for runway ends, providing clear visual cues for pilots.",
      "image": "/images/inset-runway-end.jpg",
      "features": [
        "Flush-mounted for safety",
        "Weatherproof and durable",
        "Consistent brightness"
      ]
    },
    "inset_threshold_wingbar": {
      "title": "Inset Threshold Wingbar",
      "description": "Inset wingbar lights for runway thresholds, enhancing lateral guidance.",
      "image": "/images/inset-wingbar.jpg",
      "features": [
        "High-visibility LEDs",
        "Flush installation",
        "Long service life"
      ]
    },
    "inset_threshold_runway_end_lights": {
      "title": "Inset Threshold/Runway End Lights",
      "description": "Combined inset lights for marking both thresholds and runway ends.",
      "image": "/images/inset-threshold-runway-end.jpg",
      "features": [
        "Dual-purpose design",
        "Bright, energy-efficient LEDs",
        "Easy to install and maintain"
      ]
    }
  }
}